Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator
DO NOT USE! For internal usage only!

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.MoreObjectsLeft
The number of objects left.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.NumberOfObjects
The number of objects.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.Filter
The filter of the enumerator.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.NumberOfObjectToStart
The number of objects to the start of the enumerator.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.Objects
The list of objects selected.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.ObjectTypes
The list of object types selected.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.ObjectTypeToSelect
The type of the objects to be selected.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.Id1
The identifier of the father object.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.Object1Type
The type of the father object.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.Id2
The identifier of the sub object.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.Object2Type
The type of the sub object.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.Id3
The identifier of an additional object 3.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.Id4
The identifier of an additional object 4.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.Id5
The identifier of an additional object 5.

Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator.ClientId
The identifer of the client.